# Taps
tap "homebrew/cask"
tap "homebrew/core"

# Packages
brew "wget"
brew "nvm"
brew "git"
brew "zsh" 
brew "ffmpeg"
brew "gh"
brew "graphicsmagick"
brew "imagemagick"
brew "jpeg-xl"
brew "yt-dlp"
brew "mas"
brew "webp"
brew "qrencode"

# Casks (Essentials)
cask "raycast"
cask "chrome"
cask "readdle-spark"
cask "slack"
cask "discord"
cask "1password"
cask "notion"
cask "spotify"
cask "zoom"
cask "hiddenbar"
cask "moom"

# Casks (Development)
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "transmit"

# Casks (Design)
cask "adobe-creative-cloud"
cask "figma"
